ZeroVoid10/STM32Code/nrf_trans/location/Inc/icm20600.h
#ifndef __ICM20600_H
#define __ICM20600_H

#include "i2c.h"
#include "stm32f1xx_hal.h"

#define ICM_ADDR        0xD0

#define	SMPLRT_DIV		0x19	//陀螺仪采样率，典型值：0x01(500Hz)
//采样频率=陀螺仪输出频率/(1+SMPLRT_DIV )    陀螺仪输出频率当低通滤波不开的时候为8KHZ，当低通开的时候为1K

// ICM寄存器地址,详见ICM手册
#define	MPU_CONFIG		0x1A	//低通滤波频率，典型值：0x01(188Hz)
#define	GYRO_CONFIG		0x1B	//陀螺仪自检及测量范围，典型值：0x18(不自检，2000deg/s)
#define	ACCEL_CONFIG	0x1C	//加速计自检、测量范围及高通滤波频率，典型值：0x01(不自检，2G，5Hz)
#define ACCEL_CONFIG2   0x1D                    // ICM20600增加
#define FIFO_ENABLE     0x23                    //ICM20600增加
#define GYRO_FIFO_EN    0x10
#define ACCEL_FIFO_EN   0x08 
#define INT_PIN_CFG		0x37
#define	ACCEL_XOUT_H	0x3B
#define	ACCEL_XOUT_L	0x3C
#define	ACCEL_YOUT_H	0x3D
#define	ACCEL_YOUT_L	0x3E
#define	ACCEL_ZOUT_H	0x3F
#define	ACCEL_ZOUT_L	0x40
#define	TEMP_OUT_H		0x41
#define	TEMP_OUT_L		0x42
#define	GYRO_XOUT_H		0x43
#define	GYRO_XOUT_L		0x44	
#define	GYRO_YOUT_H		0x45
#define	GYRO_YOUT_L		0x46
#define	GYRO_ZOUT_H		0x47
#define	GYRO_ZOUT_L		0x48
#define	PWR_MGMT_1		0x6B	//电源管理，典型值：0x00(正常启用)
#define	WHO_AM_I	    0x75	//IIC地址寄存器(默认数值0x68，只读)


typedef enum{
	RANGE250=0x00,    //+-250
	RANGE500=0x08,
	RANGE1000=0x10,
	RANGE2000=0x18
}GYRO_RANGE;

typedef enum{
	RANGE2G=0x00,
	RANGE4G=0x08,
	RANGE8G=0x10,
	RANGE16G=0x18
}ACCEL_RANGE;

typedef struct{
	GYRO_RANGE gyro_range_setting;
	ACCEL_RANGE accel_range_setting;
	uint8_t accel_lpf_setting;
	float gyro_range;
	int16_t accel_range;
}ICM_Device_Setting;

void ICM_Init();
void ICM_Read_Raw(int16_t ac[],int16_t gy[]);
void Gyroraw_to_Angle_Speed(int16_t *gy,float *angle_speed );
void Accraw_to_Acceleration(int16_t *ac,float *acceleration);
#endif
